In [8]:
import pandas as pd

In [17]:
df=pd.read_csv('ME.csv')

In [16]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.columns

Index(['NAME.S.NO', 'MARKS'], dtype='object')

In [20]:
df.head()

       NAME.S.NO  MARKS
Anoop          1     79
Atul           2     89
Amit           3     99

In [21]:
df.head(2)

       NAME.S.NO  MARKS
Anoop          1     79
Atul           2     89

In [22]:
df.head()

       NAME.S.NO  MARKS
Anoop          1     79
Atul           2     89
Amit           3     99

In [23]:
df.columns

Index(['NAME.S.NO', 'MARKS'], dtype='object')

In [26]:
type(df['MARKS'])

pandas.core.series.Series

In [31]:
list=type(df[['MARKS']])

In [33]:
df['MARKS']

Anoop    79
Atul     89
Amit     99
Name: MARKS, dtype: int64

In [39]:
pd.read_csv('ME.csv')

    NAME     AGE      GENDER
0  ALICE      25     FEMALE
1    BOB      30        MALE
2  CLARE      27      FEMALE

In [41]:
pd.read_csv('Q1.csv')

   DATA  S.NO
0     1     4
1     2     8
2     3    15
3     4    16
4     5    23
5     6    42

In [42]:
pd.read_csv('Q2.csv')

   DATA  S.NO
0     1    11
1     2    22
2     3    33
3     4    44
4     5    55
5     6    66
6     7    77
7     8    88
8     9    99
9    10   100